//=============================================================================
//
// ステージ1処理 [stage1.h]
// Author : 林　劭羲
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitStage1(void);
void UninitStage1(void);
void UpdateStage1(void);
void DrawStage1(void);
